weather-site/content/buenos_aires_weather.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: buenos_aires_weather
#+date: 2026-07-16
#+author: Echeverría Steven, Jami Mateo, Pérez Martín y Zúñiga Sebastián.
#+email: sebastian.zuniga@epn.edu.ec
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.3 (Org mode 9.6.15)
#+cite_export:

* Datos del clima en Buenos Aires
El siguiente código permitió generar un conjunto de registros del
clima en Buenos Aires, argentina. estos datos se obtienen cada 15
minutos desde la API de openweathermap.

** Código utilizado
Para realizar este procedimiento, se empleó el siguiente código de
Python:


Definición de variables e imports necesarios:

#+begin_src python :session :results output :exports both
import os
import requests
import pandas as pd
from datetime import datetime

# FUENTES CONSULTADAS:
# - OpenWeatherMap Current Weather: https://openweathermap.org/current
# - Pandas json_normalize: https://pandas.pydata.org/docs/reference/api/pandas.json_normalize.html
# - Pandas concat: https://pandas.pydata.org/docs/reference/api/pandas.concat.html

API_KEY = "62d2107136670bd7f62c2c23cea30130"
LAT = -34.6037
LON = -58.3816
#+end_src

Procesamiento de datos con fecha y hora. Además, en esta sección se
guarda los datos en un archivo .csv:

#+begin_src python :session :results output :exports both
# Unidades métricas (C° y m/s)
URL = f"https://api.openweathermap.org/data/2.5/weather?lat={LAT}&lon={LON}&appid={API_KEY}&units=metric"

try:
   
    response = requests.get(URL)
    response.raise_for_status()
    data = response.json()
    df_new = pd.json_normalize(data)
    df_new['dt'] = datetime.now().strftime('%Y-%m-%d %H:%M:%S')

    try:
        script_dir = os.path.dirname(os.path.abspath(__file__))
    except NameError:
        script_dir = os.getcwd()
        
    csv_path = os.path.join(script_dir, 'clima-buenosaires-hoy.csv')
    
    if os.path.exists(csv_path):
        df_existing = pd.read_csv(csv_path)
        df_all = pd.concat([df_existing, df_new], ignore_index=True)
        df_all.to_csv(csv_path, index=False)
    else:
        df_new.to_csv(csv_path, index=False)

    print("Datos meteorológicos de Buenos Aires agregados con éxito")

except Exception as e:
    print(f"Error en la ejecución: {e}")
#+end_src

Luego, se creó un archivo denominado get-weather.sh para obtener los
datos del clima en Buenos Aires, Argentina cada 15 minutos. Los
resultados producidos por el mismo se guardan en el archivo clima-buenosaires-hoy.csvwe :

#+begin_src emacs-lisp :results value table
(with-temp-buffer
  (insert-file-contents "~/BuenosAiresWeather/clima-buenosaires-hoy.csv")
  (mapcar (lambda (line)
            (split-string line ","))
          (split-string (buffer-string) "\n" t)))
#+end_src

#+RESULTS:
| weather      | base             | visibility                       | dt               | timezone |    id | name                |    cod | coord.lon | coord.lat   | main.temp | main.feels_like | main.temp_min | main.temp_max | main.pressure | main.humidity | main.sea_level | main.grnd_level | wind.speed | wind.deg | wind.gust | clouds.all | sys.type | sys.id | sys.country | sys.sunrise | sys.sunset |    |            |            |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 16:48:02 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.23 |         14.87 |         13.82 |          16.05 |            1008 |         79 |     1008 |      1007 |       0.45 |       23 |   0.89 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 17:57:05 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         14.89 |         14.55 |         14.37 |          15.53 |            1009 |         81 |     1009 |      1008 |       3.41 |       45 |   7.87 |         100 |           2 |    2008409 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 17:59:07 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.51 |         15.21 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       3.41 |       45 |   7.87 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 17:59:41 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.51 |         15.21 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       3.41 |       45 |   7.87 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 18:00:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.51 |         15.21 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       3.41 |       45 |   7.87 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 18:07:18 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.65 |         15.36 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       0.45 |       23 |   0.89 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 18:15:04 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.65 |         15.36 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       0.45 |       23 |   0.89 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 18:30:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.76 |         15.48 |         14.37 |          16.61 |            1009 |         80 |     1009 |      1008 |       0.45 |       45 |   1.79 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 18:45:02 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.82 |         15.55 |         14.88 |          16.61 |            1009 |         80 |     1009 |      1008 |       0.45 |       45 |   1.79 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 19:00:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         16.01 |         15.73 |         14.93 |          16.61 |            1009 |         79 |     1009 |      1008 |       0.45 |       45 |   1.79 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 19:15:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         16.62 |         16.37 |         15.44 |          17.26 |            1009 |         78 |     1009 |      1008 |       3.04 |       49 |   7.22 |         100 |           2 |    2020613 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 19:30:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |          16.6 |         16.38 |         14.93 |          17.26 |            1009 |         79 |     1009 |      1008 |       3.04 |       49 |   7.22 |         100 |           2 |    2020613 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 19:45:02 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         16.56 |         16.33 |         14.93 |          17.26 |            1009 |         79 |     1009 |      1008 |       3.18 |       49 |   7.27 |         100 |           2 |    2020613 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 20:00:03 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         16.62 |          16.4 |         14.93 |          17.26 |            1009 |         79 |     1009 |      1008 |       3.18 |       49 |   7.27 |         100 |           2 |    2020613 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 20:30:04 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.92 |         15.66 |          15.4 |          16.61 |            1009 |         80 |     1009 |      1008 |       3.18 |       49 |   7.27 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 20:45:04 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.87 |          15.6 |         14.88 |          16.61 |            1009 |         80 |     1009 |      1008 |        2.7 |       50 |   5.48 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 21:00:04 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.84 |         15.57 |         14.88 |          16.61 |            1009 |         80 |     1009 |      1008 |        2.7 |       50 |   5.48 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
| "[{'id': 804 | 'main': 'Clouds' | 'description': 'overcast clouds' | 'icon': '04n'}]" | stations | 10000 | 2026-07-15 21:15:05 | -10800 |   6693229 | San Nicolas |       200 |        -58.3816 |      -34.6037 |         15.92 |         15.66 |          15.4 |          16.61 |            1009 |         80 |     1009 |      1008 |        2.7 |       50 |   5.48 |         100 |           2 |    2031595 | AR | 1784113074 | 1784149239 |
